[
  {
    "paper_id": "d5a4de5dfd7fd31b",
    "title": "China-founded AI-agent start-up Manus acquired by Zuckerberg's ...",
    "url": "https://finance.yahoo.com/news/china-founded-ai-agent-start-093000547.html",
    "published_date": "2026-01-16",
    "abstract": "# China-founded AI-agent start-up Manus acquired by Zuckerberg's Meta for 'billions'. A China-founded start-up that specialises in artificial intelligence agents was acquired by US tech giant Meta Platforms for billions of dollars, marking a landmark deal amid US-China competition in AI technology. The two companies did not disclose the deal value, but Chinese technology news outlet LatePost reported that Manus was sold to Meta for \"billions of US dollars\". Earlier this month, the company released its latest flagship model, Manus 1.6 Max. In a social-media post, Ji reflected on the symbolism of the deal, posting pictures that showed Meta founder Mark Zuckerberg and he both working on start-up launches in the same room in Palo Alto, California - albeit separated by several years. The acquisition of Manus aligns with Meta's pivot towards agentic AI - systems capable of independent reasoning and task execution - which Zuckerberg has identified as the next frontier in the company's road map towards artificial general intelligence.",
    "score": 0.9991573,
    "source": "tavily"
  },
  {
    "paper_id": "f9d24bf5b90a8050",
    "title": "China initiates regulatory probe into Meta's Manus acquisition",
    "url": "https://www.phoenixstrategy.group/blog/china-regulatory-probe-meta-manus-acquisition",
    "published_date": "2026-01-16",
    "abstract": "# China initiates regulatory probe into Meta's Manus acquisition. China to probe Meta’s acquisition of AI startup Manus amid US-China tech tensions. China has announced an investigation into Meta’s recent acquisition of the artificial intelligence startup Manus, signaling a heightened focus on technology transfers amidst ongoing tensions between Beijing and Washington. Meta, the California-based parent company of Facebook and Instagram, revealed last week that it was purchasing Manus, a Singapore-based AI firm with Chinese origins. The move comes as Meta seeks to expand its AI capabilities, but the acquisition has drawn scrutiny due to Manus’ historical ties to Beijing-registered entities. \"Any enterprises engaging in outward investment, technology export, data transfer and cross-border mergers and acquisitions must comply with Chinese laws\", He said. The acquisition has raised concerns among Chinese regulators and experts over potential technology exports. Meta clarified that there would be \"no continuing Chinese ownership interests in Manus AI\" following the acquisition and stated that Manus would discontinue its services and operations in China.",
    "score": 0.99711037,
    "source": "tavily"
  },
  {
    "paper_id": "342e3858566e223c",
    "title": "Meta's $28.6B Acquisition of Manus: China Shedding in AI Works",
    "url": "https://www.linkedin.com/posts/ivyyangxi_meta-acquiring-manus-is-the-clearest-proof-activity-7413950528038129664-JYGp",
    "published_date": "2026-01-16",
    "abstract": "This is evident from Meta's recent acquisition of Manus, a Chinese-founded AI firm valued at more than $2 billion, as it seeks to enhance its technological capabilities. Breaking News🚨 Meta acquires Manus AI — and this one matters 🚨 The transaction is a significant milestone in global tech for several reasons: 1️⃣ A US tech giant acquires a leading AI player with deep Chinese roots With Meta acquiring Singapore-based Manus AI, we’re seeing a rare and probably highly controversial transaction: In an environment defined by US - China decoupling, Mark Zuckerberg is signaling that the best technology wins, regardless of origin. Next: This is no small deal: It is reportedly Meta’s 3rd largest deal ever, second only to WhatsApp and Scale AI‼️ 2️⃣ Chinese AI isn't \"catching up\" — it's frontier tech The acquisition validates what insiders have seen throughout 2025: Manus AI's agents have been outperforming competitors like OpenAI’s DeepResearch in complex, autonomous task execution.",
    "score": 0.99690056,
    "source": "tavily"
  }
]